Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 莫雪一脸歉意的看着妹妹，无声的说了句对不起，一个逃脱总比两个人都死在这里好，等她讨回古玛部落后，她一定会让爹爹替妹妹报仇，然后她就让法宝弥漫出来的空间之力将她包裹起来。
en_us: Mo Xue looked at her younger sister apologetically, silently saying sorry. One of them surviving would be better than if both of them died here. After she returned to the Guma Tribe, she would have her father avenge her younger sister. She let the spacial force that seeped out of the magic tool envelop her.

source: 莫雪三人跟他们并不住在同一家客栈，不过谢俊的探险队却住在这里，而且距离洞城较近，所以他们回到小镇就直奔客栈的房间，动静不小，不少人纷纷探出头看情况。
en_us: Mo Xue's three man group didn't live in the same place as them but Xie Jun's exploration team did. It was closer to Dong Yu thus, when the returned to town, they headed here. They caused a big commotion so many people peaked out their heads to take a look.

source: 莫雪亦冷冷的看了他们一眼。
en_us: Mo Xue still looked at them coldly.

source: 莫雪俏脸娇羞一片，几乎快醉倒在他的甜言蜜语下。
en_us: Mo Xue's alluring face became bashful and she was almost drunk on his honeyed words.

source: 莫雪几人也是现在才发现他们忌惮的人竟然是熟人。
en_us: Mo Xue and co then realized that the person they were afraid of was a familiar face.

source: 莫雪只觉得他特别英俊，特别体贴，而且还有实力，一颗心都快化在他身上，听到他的话连忙附和道：“谢大哥说的是，不过眼下我们也找不到同伴……”
en_us: Mo Xue just thought he was especially handsome and considerate. In addition, he was strong and she was quickly taking a liking to him (一颗心都快化在他身上). She promptly agreed with Xie Jun when she heard what he said, "Xie-dage is right, but we cannot find our comrades at the moment..."

source: 莫雪听出谢俊的暗示，虽然很想顺从他的话，但是一直以来的骄傲却让她低不下头，“谢大哥，我们这么多人，难道还要怕他一个人不成！”
en_us: Mo Xue could understand what Xie Jun was implying and wanted to follow his words but her usually pride kept her from lowering her head. Instead, she said, "Xie-dage, we are a group, why are we afraid of one person!"

source: 莫雪听到牛徐阳的声音立刻冷下脸，“牛徐阳，谢大哥可是救我们的人，你怎么可以对他吼，而且要不是你这么没用，我们又怎么会落到这种地步？”
en_us: Mo Xue's expression immediately chilled upon hearing Niu XuYang's voice, "Niu XuYang! Xie-dage is our rescuer, how can you shout at him? Would we have fallen to this extent if you weren't so useless?"

source: 莫雪听到这句话也期待的看着她。
en_us: When Mo Xue heard this, she also looked eagerly at her.

source: 莫雪和莫菲却完全没有察觉到不对劲，莫菲甚至还在咒骂谁谁谁的不是，其中包括夏音，让游小默大开了眼界。
en_us: Mo Xue and Mo Fei didn't snese that there was anything wrong and Mo Fei was even cursing people out loudly, Xia Yin amongst them. This was a huge shock to You XiaoMo.

source: 莫雪和莫菲是什么品行她看得一清二楚。
en_us: She was crystal clear about what Mo Xue and Mo Fei's behaviour were like.

source: 莫雪和莫菲最后决定加入谢俊的队伍，跟他们一起走，牛徐阳想了想最后还是决定跟他们一起，他一个人在洞域没有自保的能力。
en_us: Mo Xue and Mo Fei finally decided to join Xie Jun's team and go with them. Niu XuYang thought about it before he decided to join them. He did not have the strength to protect himself in DongYu (洞域).

source: 莫雪和莫菲期待的看过去，如果是个帅哥就热情一点，如果不是，就随便谢一句好了。
en_us: Mo Xue and Mo Fei expectantly looked over. If it was a handsome guy, they'd behave a little more enthusiastically. If not, they would just carelessly say a word of thanks.

source: 莫雪和莫菲的表情立刻像吃了大便一样难看，瞪大眼睛，嘴巴合不拢了，现实明显跟她们开了一个玩笑，她们一直轻视看不起的人竟然是个真正的强者？
en_us: Mo Xue and Mo Fei's expressions were ugly like they had just eaten shit. Their eyes were wide, jaws dropped. Reality had played a cruel trick on them. The person they had looked down on was a true powerhouse?

source: 莫雪哪有能力救她，她都自身难保了，听到妹妹的求救声一不小心就分神了，脖子被一名强盗擒住，整张俏脸都憋红了。
en_us: How could Mo Xue go rescue her? She was unable to even protect herself, but when she heard her little sister's cries for help, she accidentally got distracted. A bandit caught her around the neck, and her pretty face went red with a lack of air.

source: 莫雪姐妹并没有听出凌霄的意思，她只觉得自己被这个男人深深的轻视了，那种视她为蝼蚁的眼神看得她心头直冒火。
en_us: Mo Xue and her sister did not understand the meaning of Ling Xiao's words. She only felt that she was deeply despised by this man who looked at her as if she was a lowly ant (蝼蚁). This made her burn with rage.

source: 莫雪尖叫起来，几乎快要晕过去了。
en_us: Mo Xue screamed and seemed like she was about to faint.

source: 莫雪很快就叫不出来了，喉咙好像被烧坏了一样，另外半张脸也烧了起来，看起来异常狰狞，痛得他在地上不停的打滚，指甲用力过度崩坏了，可是这点痛已经不算什么。
en_us: Soon, she was unable to scream, as if her throat had been burnt. One half of her face caught on fire as well, making it eerily hideous. She kept rolling on the floor because of the pain and her finger nails broke due to pressure, but that pain was nothing in comparison.

source: 莫雪恨恨的符合道：“没错，而且我怀疑，他根本早在一旁看了很久，那颗果核就是证据，他要是真心想救我们，怎么会到最后一刻才出手？”
en_us: Mo Xue hatefully echoed, "That's right. What more, I suspect that he had been watching on the sidelines for a long time. That fruit pit is the proof. Why would he wait till the last minute to make a move if he genuinely wanted to save us?"

source: 莫雪恼羞成怒，一双美目几乎喷火一般，典型忘恩负义的家伙，不过游小默也不指望她报恩。
en_us: Mo Xue was shamed into anger. Flames were almost shooting out of her beautiful eyes. She was really the model of one devoid of gratitude. Anyway, You XiaoMo did not expect her to repay his kindness.

source: 莫雪抚着自己的脸，想到以后永远要顶着这副鬼样子，她对游小默和凌霄的仇恨几乎形成一股冲天的怨气，她一定要他们不得好死！
en_us: Mo Xue stroked her own face. When she thought about how she would have to carry this demonic appearance forever, the hostility that she had towards You XiaoMo and Ling Xiao essentially took shape into a soaring resentment. She would definitely make them suffer a painful death!

source: 莫雪握住他的手，温柔的看着他说：“不，谢大哥不用谦虚，你救了我们两姐妹是事实，莫雪一定会报答你的。”
en_us: Mo Xue clasped his hand and looked at him tenderly, "No, there's no need to be modest, Xie-dage. It is true that you saved us two sisters. Mo Xue will surely repay you."

source: 莫雪有很严重的审美观念，在她眼中，长得丑的男人都是脏东西，而脏东西就该滚得远远的，至于丑的标准，可以参考清秀可爱的游小默。
en_us: Mo Xue's aesthetic standards were extremely strict. In her eyes, men who looked ugly were all dirty objects, and dirty objects should beat it far, far away from her. As for her standards for ugliness, one could refer to the delicate, pretty, and adorable You XiaoMo.

source: 莫雪柔弱的倚在他的胸膛上，嘤嘤的哭泣起来，摇摇头：“我没有受伤，我只是喜极而泣，要不是公子及时赶到，我、我……呜呜呜，公子的救命之恩，莫雪不知道怎么报答才好。”
en_us: Mo Xue weakly leaned on his chest while she sobbed and shook her head, "I'm not hurt, I was just crying tears of joy. If Sir hadn't arrived in time, I, I... wu wu wu (呜呜呜). Mo Xue doesn't know how to repay Sir's life-saving grace."

source: 莫雪气得心脏剧烈的抽动起来，竟然敢用这种语气跟她说话，要是在古玛部落，她早让人撕烂他的嘴巴了。
en_us: Mo Xue was so angry that her heart was violently spasming. They actually dared to speak to her in such a tone! If they were in the Guma Tribe, she would have long gotten someone to tear his mouth to pieces.

source: 莫雪气得脸都青了，胸口剧烈的起伏着，波涛汹涌的曲线看得对面的强盗们一阵心猿意马，内心蠢蠢欲动。
en_us: Mo Xue turned livid with rage.

source: 莫雪浑身一冷，打了个寒颤。
en_us: Mo Xue entire body became cold and she started shivering.

source: 莫雪激动的摇晃着桌子，她现在也就只能用这种方法表达内心的想法，明明之前还说可能有办法，现在却反口说不能治，分明就是不想帮她。
en_us: Mo Xue shook the table in agitation. Now she could only express her inner thoughts in this manner. She had obviously said there might be a way before, but now she went back on her words and said it could not be healed. It was evident that she just did not want to help her.

source: 莫雪狰狞的笑起来，她的面纱早在打斗的时候掉落，一张脸看起来异常恐怖，在小秋冲过来的时候，她立刻启动法宝，法宝是她爹请人制作给她们的逃命东西，得用空间之力进行短距离瞬间移动，当初之所以跑到游小默前面就是用了这件宝贝。
en_us: Mo Xue grinned, her face becoming terrifying; the veil she was wearing had fallen early into the fight. When Xiao Qiu charged over, she immediately activated the magic tool. The tool was something her father had specially made to help her flee from dangerous situations. It used spacial force to teleport the user instantly across a short distance. Before, when she had appeared in front of You XiaoMo, it had been through this treasure.

source: 莫雪的实力只有帝境三星，其实已经不低，但是强盗头子的手下一个个的修为也差不多，单挑或许可以打成平手，但是一对二就不可能了。
en_us: Mo Xue's level of strength was only at the Emperor three-star level. In reality, it wasn't low, but all of the subordinates under the bandit chief also were around the same level. If she fought them one-on-one, it could perhaps result in a draw, but it was impossible if it was two-against-one.

source: 莫雪的话立刻得到莫菲的响应，两姐妹理都没理牛徐阳立刻跟了过去，牛徐阳无奈，只能跟上去。
en_us: Mo Xue's words were immediately supported by Mo Fei and the two went in without asking for Niu XuYang's opinion. All Niu XuYang could do was follow them.

source: 莫雪看到白衣女人出现很激动，但是她说不出话来，只能坐着干着急，还好她妹妹立刻把人带过来。
en_us: Mo Xue was very excited when she saw the woman in white appear, but she couldn't speak. She could only sit there anxiously, but luckily, her little sister immediately brought her over.

source: 莫雪知道这个时候不应该在挑衅他，但是他就是忍不住，曾经被他鄙夷的人现在竟然爬到她的头顶上，俯视的人变成了他，她受不了。
en_us: Mo Xue knew that she shouldn't provoke him but she couldn't help it. Someone she once looked down upon was now above her. Now the one to look up became her, she couldn't take it.

source: 莫雪立刻激动的站起来，身体撞到桌子也不管，她不要毁容一辈子。
en_us: Mo Xue instantly stood up agitatedly, not even caring that she slammed into the table. She didn't want to be disfigured for her whole life.

source: 莫雪紧紧地抓着莫菲，她毕竟是姐姐，遭遇连番打击之后，她已经不那么天真，她看得出来，两名女侍是真的对她们动了杀心。
en_us: Mo Xue grasped Mo Fei tightly. She was the older one, after all, and after blow after blow, she was no longer as naive as before. She could see that the two attendants truly did want to kill them.

source: 莫雪虽然受了伤，但是只是毁容而已，实力并没有倒退，不过姐妹俩的实力不如两名女侍，没过多久就落于下风。
en_us: Though Mo Xue had been injured, it had only destroyed her beauty and hadn't affected her skill. However, the sisters weren't as strong as the two attendants and soon fell to a disadvantage.

source: 莫雪跌回椅子上，无声的流出眼泪，她虽然不是丹师，但是如何会不知道五品以上的彩丹有多麽难练，何况想要炼丹也要有丹方。
en_us: Mo Xue fell back onto her chair, and soundlessly began to cry. Even though she wasn't a mage, but how could she not know how difficult it was to refine a rainbow pill that was above grade five? Moreover, even if they wanted to refine pills, they still needed a pill recipe.

source: 莫雪迟疑了一下，她没有看到果子核飞来的方向，但当时他们是背对着谢俊一群人，确实不可能是谢俊出的手。
en_us: Mo Xue hesitated for a moment. She did not see the direction where the fruit pit came flying from, but since their backs were to Xie Jun's group at that time, it was indeed impossible for Xie Jun to have done it.

source: 莫雪顿时如坠冰窟，恐惧的情绪如雨后春笋般争先恐后的冒出来，她现在才开始后悔为什么要为了那点面子出言挑衅对方，她害怕的紧紧的抓着谢俊的手臂，半个身子都快躲到谢俊身后。
en_us: As if she had fallen into an ice pit, feelings of fear, like the sprouts erupting after the rain, erupted one after another. It was only now, that she started to regret provoking them for her pride. In fear, she held on tightly to Xie Jun's arm, with half of her body hiding behind him.

source: 莫非身体僵硬了两秒，立刻不敢上前了，她哭倒在谢俊怀里。
en_us: Mo Fei's body froze for a second and she didn't dare go up anymore, instead, she cried into Xie Jun's hug.

source: 获胜者凌霄，经验值增加一百，轻松过关。
en_us: The winner: Ling Xiao. Experience: +100. An easy victory.

source: 落地的时候，独眼刀疤以右脚尖为支撑点，迅速的调整姿势再发力，像迅猛出闸般朝游小默冲了过去。
en_us: When he landed, One-Eyed Scarface used the ball of right foot as a pivot point, swiftly readjusting his position and, with a push, shot out at You XiaoMo like a bullet.

source: 虽然不如以前干脆利落的法子，但是偶尔来一次也不无所谓，当然，最好是背着他家夫人做。
en_us: Although it was inferior to his previous direct and efficient method,but once in a while, it doesn't matter once in a while. Of course, it was better to do it while with carrying his wife on his back.

source: 虽然不是很清楚他为什么要炼化玄泽的尸体，但是他隐约能猜到一些。
en_us: Although he wasn't completly sure why he (炼化) Xuan Ze's corpse, he felt he caught onto something though.

source: 虽然不知道江流为什么要抓这个人，但是看他的样子不像是在说谎，唐中华半信半疑走到凌霄面前。
en_us: Though they didn't know why Jiang Liu wanted to capture this person, he didn't seem like he was lying. Tang ZhongHua walked up to Ling Xiao, half doubtfully.

source: 虽然不知道龙血是不是那头银龙的，但是不妨碍众人对它的垂涎。
en_us: Although it was not known whether the dragon blood was from that particular Silver Dragon, it did not hinder everyone from coveting it.

source: 虽然他不重，但那重量还是把凌霄给砸醒了，虽然他不是凡夫俗子，丹师那话儿再怎么锻炼也跟凡夫俗子一样。
en_us: Although he was not heavy, that weight was enough to disturb (砸醒) Ling Xiao from his sleep. Despite the fact that he was not an ordinary mortal man, a mage's genitalia was still the same as an ordinary mortal man's no matter how much they cultivated.

source: 虽然他们当时在鬼冢山脉其他地方，但来得不算晚，以为内天狗一共有十二个成员，眼下还差五人，不过不包括麟古。
en_us: Although they were at another area of the Ghost Tomb Mountain Range at that time they were to gather, it not considered late as the Tengu had a total of twelve members, and there were still five members who had not arrived. However, this did not include Gu Lin.

source: 虽然他们得罪的不是九夜本人，但是能与九夜这样的天之骄子结交的人其实泛泛之辈？
en_us: Although the person they had offended was not Jiu Ye himself, how could a person who was able to make friends with this kind of specially privileged person like Jiu Ye actually be an ordinary person?

source: 虽然他们是修炼者，但是他们用的药并不是普通的迷药，那种东西也就只能对付凡人而已。
en_us: Although they were practitioners, the drugs they used weren't normal either. The normal stuff would only work on normal people after all.

source: 虽然他做得很隐秘，但黑衣男人却注意到了，本来他只是随口一问而已，见他露出这种反应，顿时觉得有点意思。
en_us: Although he was being very covert, the black robed man had noticed it. Originally, he was just casually asking about it, but he quickly felt a little interested upon seeing this reaction.

source: 虽然他只是匆匆的看了一眼，但是感觉却非常明显。
en_us: Even though it was just a quick glance, the feeling he got was very clear.

source: 虽然他对游咏出现在这里很惊讶，但是这个花姑更让他刮目相看，不仅没有因为游咏的身份而动摇，反而干脆利落得叫人震惊。
en_us: Although he was shocked that You Yong would appear here, this Hua Gu made him sit up and take notice (刮目相看). Not only was she not swayed by You Yong's identity, her words so direct and efficient that it was astonishing.

source: 虽然他对这片海域并不了解，但是对方刻意现出巨大的圆形，他要是不好好利用就太对不起自己了。
en_us: Though he wasn't familiar with the sea around here, it would be a waste not to use the fact that the other had assumed his immense true form.

source: 虽然他对通天殿的了解并不深，但是以通天殿的底蕴，竞争绝对会非常激烈，说实话，他对第一名的信心还真不大。
en_us: Although he did not have an in-depth understanding of the TongTian Palace, based off inside information of the TongTian Palace, the competition would be extremely fierce. To tell the truth, he had little confidence in attaining first place.

source: 虽然他已经习惯了血腥，但是这种事情能避免他还是很乐意的。
en_us: Though he was used to it by now, he preferred to avoid it if possible.

source: 虽然他承诺过那个人一旦有了心灵花草就告诉他，但是现在只有灵草堂几个人知道，只要不把这件事告诉他，等下一株灵草运来再派人知会他应该不会有问题。
en_us: Even though he had promised to inform that person the moment they received the Heart Flower Herb, but only a few people in the Magic Herb Shop knew. As long as they didn't tell him and waited until the next magic herb was shipped over before notifying him, there shouldn't be a problem.

source: 虽然他拜托过武成帮忙收集灵草，丹师十一二级灵草就是在中心城也是非常稀有的，而且竞争的人也不少，灵草最后未必会是他的。
en_us: Although he had requested for Wu Cheng to help him gather magic herbs, mage level eleven or twelve magic herbs were extremely rare even in Central City. The amount of people competing for them was also high, so it wasn't certain that the magic herbs would be his in the end.

source: 虽然他拥有从天心派带出来的六级丹方，但是和老头给他的丹方一比，灵丹的效果就大打折扣了，所以这些天他一直在练习老头给他的丹方，然后再拿到销售点去卖。
en_us: Though he had obtained the TianXin sect’s level 6 recipes, the overall effects were – when compared to the recipe the old geezer gave him – much weaker, so he focused on refining pills through the old geezer’s recipe and then selling those at the market.

source: 虽然他是队长，但是实力也不过是帝境五星，离神境还差得远。
en_us: Though he was the captain, he was only Emperor level five star, strill far from Divine level.

source: 虽然他知道篮球应该不会怪他，但是只要一想到这件事，他就觉得没脸见篮球，于是不得不忍下来，讲坛狼的内丹丢到空间的某个角落里。
en_us: Although, he figured that LanQiu wouldn't blame him for it, whenever he the thought crossed his mind, he felt like he had no face to see LanQiu. So, he held his temptation in check and threw his Life Crystal to a corner of his dimension.

source: 虽然信息很少，但是小心驶得万年船。
en_us: Although it wasn't much to go by, it's better safe than sorry. (小心驶得万年船)

source: 虽然凌霄没发誓，但是白衣帅哥已经相信他会保护好游小默。
en_us: Although Ling Xiao hadn't sworn, the handsome white-robed guy had already believed that he would protect You XiaoMo well.

source: 虽然只准进不能出，但是自然城总不可能一直都是这样子。
en_us: Although entry was allowed and exit was forbidden, it was impossible for ZiRan City to remain in this state forever.

source: 虽然只加了一千万，但关键是游震天竟然出手了，难道他也想要这张地图不成，还是说他也想帮游小默解围？
en_us: Though there was only a twenty million increase, the point was that You ZhenTian actually bid. Could it be that he wanted this map or that he wanted to help You XiaoMo get out of this snit?

source: 虽然各大势力比较强势，但是若不给这些散修机会容易引起反抗的情绪。
en_us: Although the major forces held all the power, if they didn't leave some room for the lone practitioners, then rebellious feelings might arise.

source: 虽然同样是女人，但是毛球这次却下了死手，普通的灵丹根本恢复不了，毛球是计算过的。
en_us: Although they were both women, this time MaoQiu had delivered a killing blow. There was no way for an ordinary magic pill to restore her looks, and this was something MaoQiu had calculated.

source: 虽然名单上还有不少人，但是赤血家族却把矛头对准银戈，因为他是凌霄带来的，而且身份不明。
en_us: Though there were quite a few people on that list, the ChiXue Family pointed their spear at Yin Ge because he came with Ling Xiao and they didn't know his background.

source: 虽然命留下来了，但是玄威却能感觉到身体的筋脉正在一寸一寸被破坏着，眨眼简就毁了七七八八。
en_us: Though he was still alive, XuanWei could feel the the (筋脉) within his body breaking down bit by bit, and, in the blink of an eye, it was almost completely destroyed.

source: 虽然在别人的地盘上炼丹是一件令人难以想象的事情，但游小默却真的这样做了。
en_us: Although refine pills on other people's terrietory was something unimaginable, You XiaoMo did it anyways.

source: 虽然在桃源遗迹里炼丹有些浪费时间，毕竟这里是一个探险宝地，别人探宝或修炼都来不及，哪有时间在这里炼丹。
en_us: Although it was a bit of a waste of time, refining pills here in Peach Blossom Ruins. After all, it was an treasure hunting goldmine. Others wouldn't even have enough time to be cultivating or searching for treasures, much less refining pills.

source: 虽然城门在傍晚的时候可能会开，但是谁也不知道这件事是真还是假的，现在就能出城，何必等到没有定数的傍晚。
en_us: Though the gates were said to be opened in the evening, no one knew if it was true or not. If they could leave now, why wait?

source: 虽然家底丰厚的人确实不多，但这可不是用外表就能看出来的，更不是用灵晶衡量出来的。
en_us: Though not that many people had wealthy backgrounds, this wasn't something that could be seen through their appearance, let alone measured through spirit gems.

source: 虽然心里知道入口能打开是那些圣境强者的功劳，但是他们就是忍不住怨念，盯着遗迹入口几乎恨不得现在就飞进去。
en_us: Although they knew, in their hearts that the entrance was opened by the Sacred Realm experts, they just couldn't help but complaint. If they could, all of them would've flew in immediately, given the chance.

source: 虽然有些勉强，但是灵丹的质量却不错，是一颗上品灵丹，当然，以童家的底蕴，就算拿出上品灵草亦不会有困难。
en_us: Though he had struggled a bit, but the quality of the pill was impressive, a high grade one. Of course, with his background, it wasn’t hard to get high grade magic herbs.

source: 虽然有点不吉利，但是这也叫未雨绸缪。
en_us: Although it was a little unlucky, it was still the so-called 'repairing the house before it rains.'

source: 虽然有点迁怒的意思，但是他现在就需要找个东西发泄心中的紧张。
en_us: Even though he sounded a little angry, right now what he needed was a way to vent the worry in his heart.

source: 虽然检查很严格，但是速度还是很快的，几乎不到两刻钟就轮到他们了，守卫上下打量了游小默一眼就让他进去了，就这么简单。
en_us: Although the checks were very strict, they were completed very quickly. It did not even take thirty minutes before it was their turn. The guards gave You XiaoMo a once over before letting him in. It was that simple.

source: 虽然此意淫非彼意淫，但是叔可忍，婶不能忍！
en_us: Even though this psycholagny was not that psycholagny, but even though your uncle can torelate it, your aunt can't! (但是叔可忍，婶不能忍)

source: 虽然没有亲眼见过玄龟族的人，但是形象看起来确实挺像玄龟族的。
en_us: Though he had never seen the people from the Black Turtle Clan before, the image they presented did seem like those from the Black Turtle Clan.

source: 虽然熟练更增加了，但是花费的时间却比他昨天自己一个人还要少一点。
en_us: Although there was more dishes, the time it took was a little less than yesterday, when he was by himself.

source: 虽然白衣帅哥没有说明他的身份，但是游小默多少已经猜到了，白衣帅哥应该是远古的游族先人，在大战中陨落的强者。
en_us: Although the handsome white-robed guy hadn't told them his identity, You XiaoMo had more or less already guessed it. The handsome white-robed guy should be the forefather (先人) of the You Family and one of the experts that had fallen during the ancient battle.

source: 虽然老者估出底价是七百多万，但市价比这个还要高。
en_us: Though the elder had evaluated the base price to be just over seven million, the market price was even higher.

source: 虽然莫景给了他不少顶级种子和幼苗，但是这些也需要成长时间，而顶级灵草的成长时间相对较长，所以要抓紧时间现在就种下去，免得到时需要却没有存货。
en_us: Although Mo Jing gave him many transcendent level magic herb seeds and seedlings, these also needed time to mature and the time needed for them to mature was relatively long. Therefore, it was necessary to seize the moment and plant it now so as to avoid being out of stock when it was needed.

source: 虽然赤血家族嘴上说游小默是叛徒，但还是有‘好心人’把赤血家族针对他们的真相抖了出来。
en_us: Even though the Vermillion Blood Clan was saying that You XiaoMo was a traitor, there were still 'kind-hearted souls' who dug up the truth of the Vermillion Blood Clan's connection to them.

source: 虽然这件事透着古怪，但那股吸引的感觉确实是存在的，随着凌霄打开瓶盖，那股感觉越来越强烈，要不是他心性已经锻炼得无坚不摧，这会恐怕已经把持不住了。
en_us: Though this was strange, it really was luring him in. As Ling Xiao opened the lid, the feeling he had been getting intensified. If it wasn't for the fact that he had honed his discipline and self-control, then probably would have caved already.

source: 虽然长成的条件过于苛刻与阴邪，但是骷髅花草却是炼制彩级灵丹浴火宝的主要材料。
en_us: Although the requirements to grow them were extremely harsh and eerie, the Skull Herb was still the primary ingredient for refining the rainbow magic pill Fire Bathed Jewel. (浴火宝 idk what to call this my brain is dead)

source: 虽然青年不是灵龟族，也不是通灵玄龟，但是在龟族中的排名似乎不小，而且他跟鲸岛的人很熟，一路都有人跟他在打招呼。
en_us: Although the youth wasn't from the Mystic Tortoise Clan, nor was he the Psychic Black Turtle, it seemed that his rank wasn't low in the Tortoise Clan either. Moreover, he was very familiar with the people on Whale Island, and people continuously greeted him along the way.

source: 虽然黑熊长得很丑，但是不可否认他的实力很强，而且黑熊很喜欢她，因为她喜欢开酒楼，所以黑熊就帮她开了这家酒楼。
en_us: Though Black Bear was ugly, he was truly strong, and Black Bear liked her. Since she enjoyed running taverns, Black Bear helped her open this one.

source: 虽说凌霄是圣境强者，但既然找不到风迟云就没必要在这里耽搁时间，击退游单后，凌霄立刻带着游小默离开了禁地。
en_us: Though Ling Xiao was a Sacred level powerhouse, there was no need for them to waste time here if Feng ChiYun wasn't here. After beating back You Dan, Ling Xiao immediately took You XiaoMo left with You XiaoMo.

source: 虽说是附近，但是距离活水河界还是有一定的距离。
en_us: Though it is said to be the vicinity, they were still quite a considerable distance from the Living Waters River Boundary.

source: 虽说比不上毛球这只天然的狐狸，但是突如其来的魅惑却更让人移不开眼睛，比如她的伙计，眼睛都看直了。
en_us: Though she couldn't compare to a natural fox like MaoQiu, the sudden charm made people unable to remove their gaze. For example, their server had his eyes practically glued to her.

source: 蛇球他们住的房间是他和凌霄原来住的，不用伙计带他上去，他驾轻就熟的找了上去。
en_us: SheQiu and the others lived in the room that he and Ling Xiao had lived in originally. Familiar with the place, he easily found the room.

source: 蛇球的实力虽然不错，但是以游小默的速度，他被抛下的可能性非常高，所以他也没意见，因为谁也不愿意被凌霄指着鼻子说——你还有脸当妖兽吗？
en_us: SheQiu was pretty strong, but with the speed at which You XiaoMo was improving at, he was very likely to get left behind soon, so he didn't have any complaints, because no one was willing to have Ling Xiao point at them and say - You have the face to be a demon beast?

source: 蛇球立刻自觉地闪人，猫球还想看，两只猫瞳瞪得大大的，不过中途又被返回来的蛇球给拎走了，一边教育道：“主人和大人恩爱的时候不能看，你还小，会长针眼的。”
en_us: SheQiu immediately fled the room, but CatQiu wanted to know what was going on, staring at the scene with wide eyes. However, SheQiu quickly returned to grab it, lecturing it as it was dragged out, “You can’t look when the master and lord are showing their affection for each other; you’re still young, you’ll grow sty.”

source: 蜂蜜？
en_us: Honey?
